/*
Задача A. От списка ребер к матрице смежности, ориентированный вариант
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Простой ориентированный граф задан списком ребер, выведите его представление в виде матрицы смежности.
Формат входных данных:
На вход программы поступают числа n - количество вершин в графе и m - количество ребер.
Затем следует m пар чисел — ребра графа.
Формат выходных данных:
Выведите матрицу смежности заданного графа.
*/

#include <iostream>
#include <vector>

using namespace std;

int main()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> mat(n + 1, vector<int>(n + 1, 0));

    for (int i = 0; i < m; ++i)
    {
        int u, v;
        cin >> u >> v;
        mat[u][v] = 1;
    }

    for (int i = 1; i <= n; ++i)
    {
        for (int j = 1; j <= n; ++j)
        {
            cout << mat[i][j];
            if (j < n) cout << " ";
        }
        
        cout << '\n';
    }
    return 0;
}