/*
Задача B. Степени вершин по списку ребер
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Неориентированный граф задан списком ребер.
Найдите степени всех вершин графа.
Формат входных данных:
Сначала вводятся числа n - количество вершин в графе и m - количество ребер.
Затем следует m пар чисел - ребра графа.
Каждая вершина — число от 1 до n.
Формат выходных данных:
Выведите n чисел — степени вершин графа.
i-ое выведенное число должно быть равно степени вершины с номером i.
*/

/*
Для неориентированного графа каждое ребро (u, v) увеличивает степени обеих вершин на 1.
*/

#include <iostream>
#include <vector>

using namespace std;

int main()
{
    int n, m;
    cin >> n >> m;
    vector<int> deg(n + 1, 0);

    for (int i = 0; i < m; ++i)
    {
        int u, v;
        cin >> u >> v;
        deg[u]++;
        deg[v]++;
    }
    for (int i = 1; i <= n; ++i)
    {
        cout << deg[i];
        if (i < n) cout << " ";
    }

    cout << '\n';
    return 0;
}