/*
Задача C. Обход графа
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Дан неориентированный невзвешенный граф.
Для него вам необходимо найти количество вершин, лежащих в одной компоненте связности с данной вершиной (считая эту вершину).
Формат входных данных:
В первой строке входных данных содержатся два числа: N и S, где N — количество вершин графа, а S — заданная вершина.
В следующих N строках записано по N чисел — матрица смежности графа, в которой 0 означает отсутствие ребра между вершинами,
а 1 — его наличие. Гарантируется, что на главной диагонали матрицы всегда стоят нули.
Формат выходных данных:
Выведите одно целое число — искомое количество вершин.
*/

/*
Обычный DFS из вершины S, считаем количество посещённых вершин.
*/

#include <iostream>
#include <vector>

using namespace std;

int n, s;
vector<vector<int>> adj;
vector<bool> visited;
int cnt = 0;

void dfs(int v)
{
    visited[v] = true;
    cnt++;
    for (int u = 1; u <= n; ++u)
    {
        if (adj[v][u] == 1 && !visited[u]) dfs(u);
    }
}

int main()
{
    cin >> n >> s;
    adj.assign(n + 1, vector<int>(n + 1, 0));
    visited.assign(n + 1, false);
    for (int i = 1; i <= n; ++i)
        for (int j = 1; j <= n; ++j)
            cin >> adj[i][j];
    dfs(s);
    
    cout << cnt << endl;
    return 0;
}