/*
Задача F. Дерево?
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Имеется неориентированный граф, состоящий из N вершин и M ребер.
Необходимо проверить, является ли граф деревом.
Напомним, что дерево — это связный граф, в котором нет циклов
(следовательно, между любой парой вершин существует ровно один простой путь).
Граф называется связным, если от одной вершины существует путь до любой другой.
Формат входных данных:
Во входном файле в первой строке содержатся два целых числа N и M, записанные через пробел.
Далее следуют M различных строк с описаниями ребер,
каждая из которых содержит два натуральных числа Ai и Bi,
где Ai и Bi — номера вершин, соединенных i-м ребром.
Формат выходных данных:
В выходной файл выведите слово «YES», если граф является деревом, или «NO» в противном случае.
*/

/*
Граф является деревом - он связный и m == n - 1.
Проверяем оба условия: первое - простым сравнением, второе - DFS-ом из вершины 1.
*/

#include <iostream>
#include <vector>

using namespace std;

int n, m;
vector<vector<int>> adj;
vector<bool> visited;

void dfs(int v)
{
    visited[v] = true;
    for (int u : adj[v])
        if (!visited[u]) dfs(u);
}

int main()
{
    cin >> n >> m;
    adj.assign(n + 1, vector<int>());
    visited.assign(n + 1, false);

    for (int i = 0; i < m; ++i)
    {
        int u, v;
        cin >> u >> v;
        adj[u].push_back(v);
        adj[v].push_back(u);
    }

    if (m != n - 1)
    {
        cout << "NO" << endl;
        return 0;
    }

    dfs(1);

    for (int i = 1; i <= n; ++i)
    {
        if (!visited[i])
        {
            cout << "NO" << endl;
            return 0;
        }
    }
    
    cout << "YES" << endl;
    return 0;
}