/*
Задача D. Долой списывание!
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Во время теста Михаил Дмитриевич заметил, что некоторые лкшата обмениваются записками.
Сначала он хотел поставить им всем двойки, но в тот день Михаил Дмитриевич был добрым,
а потому решил разделить лкшат на две группы: списывающих и дающих списывать, и поставить двойки только первым.
У Михаила Дмитриевича записаны все пары лкшат, обменявшихся записками.
Требуется определить, сможет ли он разделить лкшат на две группы так, чтобы любой обмен записками осуществлялся от лкшонка одной группы лкшонку другой группы.
Формат входных данных:
В первой строке находятся два числа N и M — количество лкшат и количество пар лкшат, обменивающихся записками.
Далее в M строках расположены описания пар лкшат:
два различных числа, соответствующие номерам лкшат, обменивающихся записками. Каждая пара лкшат перечислена не более одного раза.
Формат выходных данных:
Необходимо вывести ответ на задачу Павла Олеговича. Если возможно разделить лкшат на две группы, выведите «YES»; иначе выведите «NO».
*/

/*
Раскрашиваем граф в 2 цвета BFS-ом по каждой компоненте.
Если встретили ребро между вершинами одного цвета — граф не двудольный.
*/

#include <iostream>
#include <vector>
#include <queue>

using namespace std;

int main()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> adj(n + 1);

    for (int i = 0; i < m; ++i)
    {
        int u, v;
        cin >> u >> v;
        adj[u].push_back(v);
        adj[v].push_back(u);
    }

    vector<int> color(n + 1, 0);
    bool ok = true;

    for (int start = 1; start <= n && ok; ++start)
    {
        if (color[start] != 0) continue;
        queue<int> q;
        q.push(start);
        color[start] = 1;
        while (!q.empty() && ok)
        {
            int v = q.front(); q.pop();
            for (int u : adj[v])
            {
                if (color[u] == 0)
                {
                    color[u] = 3 - color[v];
                    q.push(u);
                }
                else if (color[u] == color[v])
                {
                    ok = false;
                    break;
                }
            }
        }
    }
    
    cout << (ok ? "YES" : "NO") << endl;
    return 0;
}