/*
Задача C. Постфиксная запись
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
В постфиксной записи (или обратной польской записи) операция записывается после двух операндов.
Например, сумма двух чисел A и B записывается как A B +.
Запись B C + D ∗ обозначает привычное нам (B + C) ∗ D,
а запись A B C + D ∗ + означает A + (B + C) ∗ D.
Достоинство постфиксной записи в том, что она не требует скобок
и дополнительных соглашений о приоритете операторов для своего чтения.
От вас требуется вычислить выражение, записанное в таком виде.
Формат входных данных:
В первой строке входного файла записано число n — суммарное количество операций и чисел в выражении.
В следующих n строках записан очередной элемент выражения в следующем формате:
• 0 x — очередной элемент является числом x;
• 1 — очередной элемент является знаком сложения;
• 2 — очередной элемент является знаком вычитания;
• 3 — очередной элемент является знаком умножения;
Гарантируется, что никакие промежуточные вычисления не превзойдут 2 · 10^9.
Формат выходных данных:
Необходимо вывести значение записанного выражения.
*/

#include <iostream>
#include <stack>

using namespace std;

int main()
{
    int n;
    cin >> n;
    stack<long long> st;
    
    for (int i = 0; i < n; ++i)
    {
        int t;
        cin >> t;

        if (t == 0)
        {
            long long x;
            cin >> x;
            st.push(x);
        }
        else
        {
            long long b = st.top(); st.pop();
            long long a = st.top(); st.pop();
            if (t == 1) st.push(a + b);
            else if (t == 2) st.push(a - b);
            else st.push(a * b);
        }
    }
    
    cout << st.top() << endl;
    
    return 0;
}
