/*
Задача B. Правильная скобочная последовательность
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Рассмотрим последовательность, состоящую из круглых, квадратных и фигурных скобок.
Программа дожна определить, является ли данная скобочная последовательность правильной.
Пустая последовательность явлется правильной.
Если A — правильная, то последовательности (A), [A], {A} — правильные.
Если A и B — правильные последовательности, то последовательность AB — правильная.
Формат входных данных:
В единственной строке записана скобочная последовательность, содержащая не более 100000 скобок.
Формат выходных данных:
Если данная последовательность правильная, то программа должна вывести строку yes, иначе строку no.
*/

#include <iostream>
#include <string>
#include <stack>

using namespace std;

int main()
{
    string s;
    getline(cin, s);
    stack<char> st;
    bool ok = true;

    for (char c : s)
    {
        if (c == '(' || c == '[' || c == '{')
        {
            st.push(c);
        }
        else if (c == ')' || c == ']' || c == '}')
        {
            if (st.empty())
            {
                ok = false;
                break;
            }
            char t = st.top(); st.pop();
            if ((c == ')' && t != '(') || (c == ']' && t != '[') || (c == '}' && t != '{'))
            {
                ok = false;
                break;
            }
        }
    }
    if (!st.empty()) ok = false;

    cout << (ok ? "yes" : "no") << endl;
    
    return 0;
}
