/*
Задача A. Правильная круглоскобочная последовательность
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Рассмотрим последовательность, состоящую из круглых скобок.
Программа должна определить, является ли данная скобочная последовательность правильной.
Пустая последовательность является правильной.
Если A — правильная, то последовательность (A) — правильная.
Если A и B — правильные последовательности, то последовательность AB — правильная.
Формат входных данных:
В единственной строке записана скобочная последовательность, содержащая не более 100000 скобок.
Формат выходных данных
Если данная последовательность правильная, то программа должна вывести строку yes, иначе строку no.
*/

#include <iostream>
#include <string>

using namespace std;

int main()
{
    string s;
    getline(cin, s);
    int bal = 0;
    bool ok = true;

    for (char c : s)
    {
        if (c == '(') bal++;
        else if (c == ')')
        {
            bal--;
            if (bal < 0)
            {
                ok = false; break;
            }
        }
    }
    if (bal != 0) ok = false;

    cout << (ok ? "yes" : "no") << endl;

    return 0;
}
