/*
Задача D. Стек с минимумом
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Вам дано q запросов трех типов:
• «1 x» — добавить число x на вершину стека.
• «2» — вывести на экран и удалить верхний элемент стека.
Гарантируется, что стек в данный момент времени не пуст.
• «3» — вывести на экран минимальное число стека.
Гарантируется, что стек в данный момент времени не пуст.
Формат входных данных:
В первой строке вводится одно число q — количество запросов.
В последующие q строках вводятся запросы в выше описанном формате.
Формат выходных данных:
Для каждого запроса второго и третьего типа выведите по одному числу.
*/

#include <iostream>
#include <stack>
#include <algorithm>

using namespace std;

int main()
{
    int q;
    cin >> q;
    stack<long long> st;
    stack<long long> mins;

    while (q--)
    {
        int t;
        cin >> t;

        if (t == 1)
        {
            long long x;
            cin >> x;
            st.push(x);
            mins.push(mins.empty() ? x : min(mins.top(), x));
        }
        else if (t == 2)
        {
            cout << st.top() << '\n';
            st.pop();
            mins.pop();
        }
        else
        {
            cout << mins.top() << '\n';
        }
    }
    
    return 0;
}
