/*
Задача D. Ход конем
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Дана прямоугольная доска n × m (n строк и m столбцов).
В левом верхнем углу находится шахматный конь, которого необходимо переместить в правый нижний угол доски.
При этом конь может ходить только на две клетки вниз и на одну клетку вправо, либо на две клетки вправо и на одну клетку вниз.
Необходимо определить, сколько существует различных маршрутов, ведущих из левого верхнего в правый нижний угол.
Формат входных данных:
В первой строке входного файла находятся два натуральных числа n и m.
Формат выходных данных:
Выведите единственное число количество способов добраться конём до правого нижнего угла доски.
*/

/*
Конь делает только два хода - (+2, +1) или (+1, +2).
Значит dp[i][j] = dp[i-2][j-1] + dp[i-1][j-2].
*/

#include <iostream>
#include <vector>

using namespace std;

int main()
{
    int n, m;
    cin >> n >> m;
    vector<vector<long long>> dp(n + 1, vector<long long>(m + 1, 0));

    dp[1][1] = 1;
    for (int i = 1; i <= n; ++i)
    {
        for (int j = 1; j <= m; ++j)
        {
            if (i == 1 && j == 1) continue;
            long long val = 0;
            if (i - 2 >= 1 && j - 1 >= 1) val += dp[i - 2][j - 1];
            if (i - 1 >= 1 && j - 2 >= 1) val += dp[i - 1][j - 2];
            dp[i][j] = val;
        }
    }

    cout << dp[n][m] << endl;
    return 0;
}