/*
Задача F. Калькулятор
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Имеется калькулятор, который выполняет следующие операции:
• умножить число X на 2;
• умножить число X на 3;
• прибавить к числу X единицу.
Определите, какое наименьшее количество операций требуется, чтобы получить из числа 1 число n.
Формат входных данных:
В первой строке задано целое положительное число n, не превосходящее 106.
Формат выходных данных:
В первой строке выведите одно целое число: минимальное количество операций.
Во второй строке выведите целые числа, последовательно получающиеся при выполнении операций.
Первое из них должно быть равно 1, а последнее — n.
Если решений несколько, выведите любое.
*/

/*
dp[i] - минимальное число операций для получения i из 1.
Храним parent[i], чтобы восстановить последовательность.
*/

#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main()
{
    int n;
    cin >> n;
    vector<int> dp(n + 1, 1e9);
    vector<int> parent(n + 1, 0);
    dp[1] = 0;

    for (int i = 2; i <= n; ++i)
    {
        if (dp[i - 1] + 1 < dp[i])
        {
            dp[i] = dp[i - 1] + 1;
            parent[i] = i - 1;
        }
        if (i % 2 == 0 && dp[i / 2] + 1 < dp[i])
        {
            dp[i] = dp[i / 2] + 1;
            parent[i] = i / 2;
        }
        if (i % 3 == 0 && dp[i / 3] + 1 < dp[i])
        {
            dp[i] = dp[i / 3] + 1;
            parent[i] = i / 3;
        }
    }
    cout << dp[n] << "\n";

    vector<int> path;
    int cur = n;
    while (cur != 1)
    {
        path.push_back(cur);
        cur = parent[cur];
    }

    path.push_back(1);
    reverse(path.begin(), path.end());

    for (size_t i = 0; i < path.size(); ++i)
    {
        cout << path[i];
        if (i + 1 < path.size()) cout << ' ';
    }
    
    cout << endl;
    return 0;
}