/*
Задача B. Платная лестница
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Мальчик подошел к платной лестнице. Чтобы наступить на любую ступеньку, нужно заплатить указанную на ней сумму.
Мальчик умеет перешагивать на следующую ступеньку, либо перепрыгивать через ступеньку.
Требуется узнать, какая наименьшая сумма понадобится мальчику, чтобы добраться до верхней ступеньки.
Формат входных данных:
В первой строке вводится целое число n. Во второй строке вводятся n натуральных чисел,
не превосходящих 100 - стоимость каждой ступеньки (снизу вверх).
Формат выходных данных:
Выведите единственное число - наименьшую возможную стоимость прохода по лесенке.
*/

/*
Состояние dp[i] - минимальная стоимость, чтобы попасть на ступеньку i.
Из позиции 0 (перед лестницей) можно сразу попасть на 1 или 2.
*/

#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main()
{
    int n;
    cin >> n;
    vector<int> a(n + 1);

    for (int i = 1; i <= n; ++i) cin >> a[i];
    vector<int> dp(n + 1, 0);
    dp[1] = a[1];
    if (n >= 2) dp[2] = a[2];

    for (int i = 3; i <= n; ++i)
    {
        dp[i] = a[i] + min(dp[i - 1], dp[i - 2]);
    }

    cout << dp[n] << endl;
    return 0;
}