/*
Задача C. Маршрут максимальной стоимости
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
В левом верхнем углу прямоугольной таблицы размером n · m находится черепашка.
В каждой клетке таблицы записано некоторое число.
Черепашка может перемещаться вправо или вниз, при этом маршрут черепашки заканчивается в правом нижнем углу таблицы.
Подсчитаем сумму чисел, записанных в клетках, через которую проползла черепашка (включая начальную и конечную клетку).
Найдите наибольшее возможное значение этой суммы и маршрут, на котором достигается эта сумма.
Формат входных данных:
В первой строке входных данных записаны два натуральных числа n и m, не превосходящих 100 — размеры таблицы.
Далее идет n строк, каждая из которых содержит m чисел, разделенных пробелами — описание таблицы.
Все числа в клетках таблицы целые и могут принимать значения от 0 до 100.
Формат выходных данных:
Первая строка выходных данных содержит максимальную возможную сумму, вторая – маршрут, на котором достигается эта сумма.
Маршрут выводится в виде последовательности, которая должна содержать n − 1 букву D, означающую передвижение вниз, и m − 1 букву R, означающую передвижение направо.
Если таких последовательностей несколько, необходимо вывести ровно одну (любую) из них.
*/

/*
dp[i][j] - максимальная сумма пути до (i, j).
Маршрут восстанавливается обратным ходом от (n, m).
*/

#include <iostream>
#include <vector>
#include <algorithm>
#include <string>

using namespace std;

int main()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n + 1, vector<int>(m + 1, 0));
    vector<vector<long long>> dp(n + 1, vector<long long>(m + 1, 0));

    for (int i = 1; i <= n; ++i)
        for (int j = 1; j <= m; ++j)
            cin >> a[i][j];

    dp[1][1] = a[1][1];
    for (int j = 2; j <= m; ++j) dp[1][j] = dp[1][j - 1] + a[1][j];
    for (int i = 2; i <= n; ++i) dp[i][1] = dp[i - 1][1] + a[i][1];
    for (int i = 2; i <= n; ++i)
        for (int j = 2; j <= m; ++j)
            dp[i][j] = max(dp[i - 1][j], dp[i][j - 1]) + a[i][j];

    cout << dp[n][m] << "\n";

    string path;
    int i = n, j = m;
    while (i > 1 || j > 1)
    {
        if (i == 1)
        {
            path += 'R'; --j;
        }
        else if (j == 1)
        {
            path += 'D'; --i;
        }
        else if (dp[i - 1][j] >= dp[i][j - 1])
        {
            path += 'D'; --i;
        }
        else
        {
            path += 'R'; --j;
        }
    }
    
    reverse(path.begin(), path.end());
    cout << path << endl;
    return 0;
}