/*
Задача E. Ход конем - 2
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Дана прямоугольная доска n × m (n строк и m столбцов).
В левом верхнем углу находится шахматный конь, которого необходимо переместить в правый нижний угол доски.
Формат входных данных:
В первой строке входного файла находятся два натуральных числа n и m.
Формат выходных данных:
В выходной файл выведите единственное число количество способов добраться конём до правого нижнего угла доски.
*/

/*
Ходы коня:
(+1, +2), (+2, +1), (+2, -1), (-1, +2).
У всех сумма i + j строго возрастает (на 3, 3, 1, 1),
поэтому обрабатываем клетки в порядке возрастания i + j.
*/

#include <iostream>
#include <vector>

using namespace std;

int main()
{
    int n, m;
    cin >> n >> m;
    vector<vector<long long>> dp(n + 2, vector<long long>(m + 2, 0));
    dp[1][1] = 1;

    for (int s = 3; s <= n + m; ++s)
    {
        for (int i = 1; i <= n; ++i)
        {
            int j = s - i;
            if (j < 1 || j > m) continue;
            long long val = 0;
            if (i - 1 >= 1 && j - 2 >= 1) val += dp[i - 1][j - 2];
            if (i - 2 >= 1 && j - 1 >= 1) val += dp[i - 2][j - 1];
            if (i - 2 >= 1 && j + 1 <= m) val += dp[i - 2][j + 1];
            if (i + 1 <= n && j - 2 >= 1) val += dp[i + 1][j - 2];

            dp[i][j] = val;
        }
    }

    cout << dp[n][m] << endl;
    return 0;
}