/*
Задача A. Числа Фибоначчи
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
f1 = f2 = 1, fn+1 = fn + fn−1 при n > 2.
Формат входных данных:
В единственной строке входных данных записано натуральное число n.
Формат выходных данных:
Выведите число fn.
*/

#include <iostream>

using namespace std;

int main()
{
    int n;
    cin >> n;
    
    int a, b, c;

    if (a <= b)

    long long f[50];
    f[1] = f[2] = 1;
    for (int i = 3; i <= n; ++i)
    {
        f[i] = f[i - 1] + f[i - 2];
    }

    cout << f[n] << endl;
    return 0;
}