/*
Задача B. Эвакуация
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Одна из Сверхсекретных организаций, чье название мы не имеем право разглашать, представляет собой сеть из N подземных бункеров,
соединенных равными по длине туннелями, по которым из любого бункера можно добраться до любого другого (не обязательно напрямую).
Связь с внешним миром осуществляется через специальные засекреченные выходы, которые расположены в некоторых из бункеров.
Организации понадобилось составить план эвакуации персонала на случай экстренной ситуации.
Для этого для каждого из бункеров необходимо узнать, сколько времени потребуется для того,чтобы добраться до ближайшего из выходов.
Вам, как специалисту по таким задачам, поручено рассчитать необходимое время для каждого из бункеров
по заданному описанию помещения Сверхсекретной организации. Для вашего же удобства бункеры занумерованы числами от 1 до N.
Формат входных данных:
Сначала вводятся два натуральных числа N, K — количество бункеров и количество выходов соответственно.
Далее через пробел записаны K различных чисел от 1 до N, обозначающих номера бункеров, в которых расположены выходы.
Потом идёт число M (1 6 M 6 100000) — количество туннелей. Далее вводятся M пар чисел — номера бункеров, соединенных туннелем.
По каждому из туннелей можно двигаться в обе стороны. В организации не существует туннелей, ведущих из бункера в самого себя,
зато может существовать более одного туннеля между парой бункеров.
Формат выходных данных:
Выведите N чисел, разделенных пробелом — для каждого из бункеров минимальное время,
необходимое чтобы добраться до выхода. Считайте, что время перемещения по одному туннелю равно 1.
*/

#include <iostream>
#include <vector>
#include <queue>

using namespace std;

int main()
{
    int n, k;
    cin >> n >> k;
    vector<int> exits(k);

    for (int i = 0; i < k; ++i) cin >> exits[i];
    
    int m;
    cin >> m;
    vector<vector<int>> adj(n + 1);

    for (int i = 0; i < m; ++i)
    {
        int a, b;
        cin >> a >> b;
        adj[a].push_back(b);
        adj[b].push_back(a);
    }

    vector<int> dist(n + 1, -1);
    queue<int> q;

    for (int e : exits)
    {
        if (dist[e] == -1)
        {
            dist[e] = 0;
            q.push(e);
        }
    }
    while (!q.empty())
    {
        int v = q.front(); q.pop();
        for (int u : adj[v])
        {
            if (dist[u] == -1)
            {
                dist[u] = dist[v] + 1;
                q.push(u);
            }
        }
    }
    for (int i = 1; i <= n; ++i)
    {
        cout << dist[i];
        if (i < n) cout << ' ';
    }
    cout << '\n';
    return 0;
}