/*
Задача D. Пифагоров экспресс
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
В стране Флатландии есть n городов, расположенных в целочисленных точках плоскости.
Транспортная система Флатландии настолько развита, что между любыми двумя городами ходит экспресс имени Пифагора.
С помощью него можно добраться от города с координатами x1, y1 до города с координатами x2, y2 за время (x1 − x2)^2 + (y1 − y2)^2.
По каждой линии ходит достаточно поездов, и временем на пересадки можно пренебречь.
Сообщение с внешним миром во Флатландии продумано несколько хуже, и единственный аэропорт международного сообщения находится в городе с номером s.
Вам же хочется попасть в город с номером t. Определите, за какое наименьшее время это можно сделать.
Формат входных данных:
В первой строке задано число городов n. В следующих n строках заданы координаты городов xi, yi.
В последней строке даны s и t — номера начального и конечного города в пути.
Формат выходных данных:
Выведите одно число — минимальное время, за которое можно добраться из s в t.
*/


#include <iostream>
#include <vector>

using namespace std;

int main()
{
    int n;
    cin >> n;
    vector<long long> x(n + 1), y(n + 1);

    for (int i = 1; i <= n; ++i) cin >> x[i] >> y[i];
    int s, t;
    cin >> s >> t;

    const long long INF = (long long)4e18;
    vector<long long> dist(n + 1, INF);
    vector<bool> used(n + 1, false);
    dist[s] = 0;

    for (int iter = 0; iter < n; ++iter)
    {
        int v = -1;
        for (int i = 1; i <= n; ++i)
        {
            if (!used[i] && (v == -1 || dist[i] < dist[v])) v = i;
        }
        if (v == -1 || dist[v] == INF) break;
        used[v] = true;
        for (int u = 1; u <= n; ++u)
        {
            if (!used[u])
            {
                long long dx = x[v] - x[u];
                long long dy = y[v] - y[u];
                long long w = dx * dx + dy * dy;
                if (dist[v] + w < dist[u]) dist[u] = dist[v] + w;
            }
        }
    }

    cout << dist[t] << '\n';
    return 0;
}