/*
Задача F. Числа
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Витя хочет придумать новую игру с числами.
В этой игре от игроков требуется преобразовывать четырехзначные числа не содержащие нулей
при помощи следующего разрешенного набора действий:
• Можно увеличить первую цифру числа на 1, если она не равна 9.
• Можно уменьшить последнюю цифру на 1, если она не равна 1.
• Можно циклически сдвинуть все цифры на одну вправо.
• Можно циклически сдвинуть все цифры на одну влево.
Например, применяя эти правила к числу 1234 можно получить числа 2234, 1233, 4123 и 2341 соответственно.
Точные правила игры Витя пока не придумал, но пока его интересует вопрос,
как получить из одного числа другое за минимальное количество операций.
Формат входных данных:
Во входном файле содержится два различных четырехзначных числа, каждое из которых не содержит нулей.
Формат выходных данных:
В первой строке выведите единственное число k — количество чисел в последовательности.
В следующих k строках выведите последовательность четырехзначных чисел, не содержащих нулей.
Последовательность должна начинаться первым из данных чисел и заканчиваться вторым из данных чисел,
каждое последующее число в последовательности должно быть получено из предыдущего числа применением одного из правил.
Количество чисел в последовательности должно быть минимально возможным.
*/


#include <iostream>
#include <vector>
#include <queue>
#include <algorithm>

using namespace std;

int main()
{
    int start, finish;
    cin >> start >> finish;

    vector<int> par(10000, -2);
    queue<int> q;
    par[start] = -1;
    q.push(start);

    while (!q.empty())
    {
        int cur = q.front(); q.pop();
        if (cur == finish) break;

        int d0 = cur / 1000;
        int d1 = (cur / 100) % 10;
        int d2 = (cur / 10) % 10;
        int d3 = cur % 10;

        vector<int> nxt;
        // 1 увеличить первую цифру на 1 (если не 9)
        if (d0 != 9) nxt.push_back(cur + 1000);
        // 2 уменьшить последнюю цифру на 1 (если не 1)
        if (d3 != 1) nxt.push_back(cur - 1);
        // 3 циклический сдвиг вправо: d0 d1 d2 d3 -> d3 d0 d1 d2
        nxt.push_back(d3 * 1000 + d0 * 100 + d1 * 10 + d2);
        // 4 циклический сдвиг влево: d0 d1 d2 d3 -> d1 d2 d3 d0
        nxt.push_back(d1 * 1000 + d2 * 100 + d3 * 10 + d0);

        for (int v : nxt)
        {
            if (par[v] == -2)
            {
                par[v] = cur;
                q.push(v);
            }
        }
    }

    vector<int> path;
    for (int cur = finish; cur != -1; cur = par[cur]) path.push_back(cur);
    reverse(path.begin(), path.end());

    cout << path.size() << '\n';
    for (int v : path) cout << v << '\n';
    return 0;
}